HELYXcore-4.4.0/examples/legacy/incompressible/icoFoam/cavityMappingTest/Allrun-parallel
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

runApplication -s coarseMesh blockMesh -dict system/blockMeshDict.coarse

mkdir constant/coarseMesh
mv constant/polyMesh constant/coarseMesh

runApplication -s fine blockMesh -dict system/blockMeshDict.fine

runApplication -s fine decomposePar

runApplication -s coarseMesh decomposePar -region coarseMesh

runParallel $(getApplication)

#runApplication -s fine reconstructPar
#
#runApplication -s coarseMesh reconstructPar -region coarseMesh

# -----------------------------------------------------------------------------
