HELYXcore-4.4.0/examples/legacy/incompressible/icoFoam/cavityMappingTest/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoam;

startFrom        latestTime;

startTime       0;

stopAt           nextWrite;

endTime         0.5;

deltaT          0.005;

writeControl     timeStep;

writeInterval    1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    meshInterp1
    {
        type            mapFields;
        libs            ("libfieldFunctionObjects.so");
        writeControl    timeStep;
        writeInterval   1;

        mapRegion       coarseMesh;
        mapMethod       cellVolumeWeight;
        consistent      yes;

        fields          (U); // ("U.*" "p.*");
    }
}


// ************************************************************************* //
